In [2]:
import pandas as pd
import numpy as np

# Excel dosyasının yolu
file_path = r'C:\Users\ilayd\OneDrive\Masaüstü\SalariesInSanFranciscoDataSet.xlsx'

# Excel dosyasını oku
df = pd.read_excel(file_path)

# Verinin genel bilgilerini al
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  object
 8   TotalPayBenefits  148654 non-null  object
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(1), int64(2), object(10)
memory usage: 14.7+ MB
None

In [4]:
# İlk 5 satırı yazdır
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [5]:
# Son 5 satırı yazdır
df.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0,0,0,0,0,0,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0,0,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0,0,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0,0,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0,0,-618.13,0,-618.13,-618.13,2014,NaN,San Francisco,PT

In [45]:
# Job Title sütununu al ve uzunluğunu hesapla
df['Job Title Length'] = df['JobTitle'].apply(len)

# Job Title'ı sayısal forma dönüştür (Basit bir yöntem olarak her karakterin ASCII değerlerini toplama)
df['Job Title ASCII Sum'] = df['JobTitle'].apply(lambda x: sum(ord(c) for c in x))

# Korelasyon hesaplama
correlation = df[['Job Title Length', 'Job Title ASCII Sum']].corr().iloc[0, 1]

print("Job Title Length ile Job Title ASCII Sum arasındaki korelasyon:", correlation)

Job Title Length ile Job Title ASCII Sum arasındaki korelasyon: 0.9299280067128691

In [46]:
# Genel bilgileri görüntüle
print("Toplam giriş sayısı:", len(df))
print("\nSütunlar ve veri türleri:")
print(df.dtypes)

Toplam giriş sayısı: 148654

Sütunlar ve veri türleri:
Id                       int64
EmployeeName            object
JobTitle                object
BasePay                 object
OvertimePay             object
OtherPay                object
Benefits                object
TotalPay                object
TotalPayBenefits        object
Year                     int64
Notes                  float64
Agency                  object
Status                  object
Job Title Length         int64
Job Title ASCII Sum      int64
dtype: object

In [47]:
# TotalPay sütununu sayısal türde dönüştür (hatalı verileri NaN olarak işaretle)
df['TotalPay'] = pd.to_numeric(df['TotalPay'], errors='coerce')

# TotalPay sütunundaki ortalama değeri hesapla
average_total_pay = df['TotalPay'].mean()

# TotalPay sütunundaki en yüksek değeri hesapla
max_total_pay = df['TotalPay'].max()

# Sonuçları formatla ve yazdır
print(f"TotalPay sütunundaki ortalama değer: {average_total_pay:.2f}")
print(f"TotalPay sütunundaki en yüksek değer: {max_total_pay:.2f}")

TotalPay sütunundaki ortalama değer: 74781.40
TotalPay sütunundaki en yüksek değer: 567595.43

In [48]:
# Albert Pardini'nin işi(job title)
albert_job_title = df.loc[df['EmployeeName'] == 'Albert Pardini', 'JobTitle'].values[0]

print(f"Albert Pardini'nin iş unvanı: {albert_job_title}")

Albert Pardini'nin iş unvanı: Captain 3

In [49]:
# Albert Pardini ne kadar kazanıyor
albert_Total_Pay_Benefits = df.loc[df['EmployeeName'] == 'Albert Pardini', 'TotalPayBenefits'].values[0]

print(f"Albert Pardini ne kadar kazanıyor: {albert_Total_Pay_Benefits}")

Albert Pardini ne kadar kazanıyor: 253995.29

In [50]:
# Yıllık tüm çalışanların totalpay ortalaması
# TotalPay sütununu sayısal türe dönüştür (hatalı verileri NaN olarak işaretle)
df['TotalPay'] = pd.to_numeric(df['TotalPay'], errors='coerce')

# Her yıl için TotalPay sütunundaki yıllık ortalama değeri hesapla
average_total_pay_by_year = df.groupby('Year')['TotalPay'].mean()

# Sonuçları formatla ve yazdır
for year, avg_pay in average_total_pay_by_year.items():
    print(f"{year} yılı için çalışanların yıllık toplam maaş ortalaması: {avg_pay:.2f}")

2011 yılı için çalışanların yıllık toplam maaş ortalaması: 71754.02
2012 yılı için çalışanların yıllık toplam maaş ortalaması: 74125.36
2013 yılı için çalışanların yıllık toplam maaş ortalaması: 77630.02
2014 yılı için çalışanların yıllık toplam maaş ortalaması: 75475.79

In [51]:
# Kaç tane unique iş var
unique_job_titles = df['JobTitle'].nunique()

# Sonucu yazdır
print(f"Unique iş sayısı: {unique_job_titles}")

Unique iş sayısı: 2159

In [52]:
# En yaygın 5 iş türü
# JobTitle sütunundaki her işin frekansını hesapla
job_title_counts = df['JobTitle'].value_counts()

# En yaygın 5 iş türünü al
top_5_job_titles = job_title_counts.head(5)

# Sonuçları yazdır
print("En yaygın 5 iş türü:")
print(top_5_job_titles)

En yaygın 5 iş türü:
JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

In [53]:
# JobTitle sütununda "Chief" kelimesini içeren iş unvanlarının sayısı
chief_count = df['JobTitle'].str.contains('Chief').sum()

# Sonucu yazdır
print(f"'Chief' kelimesini içeren iş unvanı sayısı: {chief_count}")

'Chief' kelimesini içeren iş unvanı sayısı: 423